app/views/pages/home.html.haml

SELECT "artists".* FROM "artists" WHERE "artists"."id" = 8 LIMIT 1
---
          %span.artistname
            = "#{piece.artist.firstname} #{piece.artist.lastname}"