app/controllers/artists_controller.rb

SELECT COUNT(*) FROM "artists"
SELECT "artists".* FROM "artists" ORDER BY lastname LIMIT 0
---
  def index
    @title = 'Artists'
    @actionClass = 'artistsindex'
    @artistcount = Artist.count
    @artists = Artist.order("lastname")

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", "7"]]
SELECT "pieces".* FROM "pieces" WHERE "pieces"."artist_id" = 7 ORDER BY id
---
  def show
    @artist = Artist.find(params[:id])
    @artistpieces = @artist.pieces.order("id")

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "pieces".* FROM "pieces" WHERE "pieces"."artist_id" = 1
---
  def edit
    @artist = Artist.find(params[:id])
    @artistpieces = @artist.pieces
    @title = "Edit #{@artist.firstname} #{@artist.lastname}"