app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY created_at DESC
---
  def index
    @title = 'Events'
    @actionClass = 'eventsindex'
    @events = Event.order("created_at DESC")