app/controllers/pages_controller.rb

SELECT "pieces".* FROM "pieces" WHERE (slideshow = 't') ORDER BY slideshoworder
---
  def home
    @title = 'Home'
    @actionClass = 'home'
    @slideshowpieces = Piece.where("slideshow = ?", true)

SELECT "artists".* FROM "artists" ORDER BY lastname
---
  def adminartists
    @title = 'Administrator | Artists'
    @actionClass = 'adminartists'
    @artists = Artist.order("lastname")

SELECT "events".* FROM "events"
---
  def adminevents
    @title = 'Administrator | Events'
    @actionClass = 'adminevents'
    @events = Event.all