app/controllers/pieces_controller.rb

  def show
    @artist = Artist.find(params[:artist_id])
    @artistpieces = @artist.pieces.order("id")
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", "8"]]
SELECT "pieces".* FROM "pieces" WHERE "pieces"."artist_id" = 8 AND "pieces"."id" = $1 ORDER BY id LIMIT 1  [["id", "23"]]